In [11]:
import pandas as pd

In [12]:
url = 'https://data.ca.gov/dataset/cea8cd18-9d21-4676-85de-d504ee2d4aab/resource/26201f19-4469-4311-a819-bbbd3e557eda/download/ca-educational-attainment-personal-income-2008-2014.csv'

table = pd.read_csv('data/ca-educational-attainment-personal-income-2008-2014.csv')

In [13]:
pd.__version__

'2.2.3'

In [14]:
table.head()

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
0,01/01/2008 12:00:00 AM,00 to 17,Male,Children under 15,No Income,NaN
1,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,No Income,650889.0
2,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,"$5,000 to $9,999",30152.0
3,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,"$10,000 to $14,999",7092.0
4,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,"$15,000 to $24,999",3974.0

In [15]:
table.tail()

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
1055,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$15,000 to $24,999",82988.0
1056,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$25,000 to $34,999",59607.0
1057,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$35,000 to $49,999",113584.0
1058,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$50,000 to $74,999",97657.0
1059,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$75,000 and over",110009.0

In [16]:
table.iloc[-1]

Year                           01/01/2014 12:00:00 AM
Age                                         65 to 80+
Gender                                         Female
Educational Attainment    Bachelor's degree or higher
Personal Income                      $75,000 and over
Population Count                             110009.0
Name: 1059, dtype: object

In [17]:
table.drop(table.index[-1]).tail()

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
1054,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$10,000 to $14,999",104583.0
1055,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$15,000 to $24,999",82988.0
1056,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$25,000 to $34,999",59607.0
1057,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$35,000 to $49,999",113584.0
1058,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$50,000 to $74,999",97657.0

In [18]:
table.drop('Population Count', axis=1)

,Year,Age,Gender,Educational Attainment,Personal Income
0,01/01/2008 12:00:00 AM,00 to 17,Male,Children under 15,No Income
1,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,No Income
2,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,"$5,000 to $9,999"
3,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,"$10,000 to $14,999"
4,01/01/2008 12:00:00 AM,00 to 17,Male,No high school diploma,"$15,000 to $24,999"
...,...,...,...,...,...
1055,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$15,000 to $24,999"
1056,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$25,000 to $34,999"
1057,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$35,000 to $49,999"
1058,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$50,000 to $74,999"
1059,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$75,000 and over"

In [19]:
table.index

RangeIndex(start=0, stop=1060, step=1)

In [20]:
table.drop

<bound method DataFrame.drop of                         Year        Age  Gender       Educational Attainment  \
0     01/01/2008 12:00:00 AM   00 to 17    Male            Children under 15
1     01/01/2008 12:00:00 AM   00 to 17    Male       No high school diploma
2     01/01/2008 12:00:00 AM   00 to 17    Male       No high school diploma
3     01/01/2008 12:00:00 AM   00 to 17    Male       No high school diploma
4     01/01/2008 12:00:00 AM   00 to 17    Male       No high school diploma
...                      ...        ...     ...                          ...
1055  01/01/2014 12:00:00 AM  65 to 80+  Female  Bachelor's degree or higher
1056  01/01/2014 12:00:00 AM  65 to 80+  Female  Bachelor's degree or higher
1057  01/01/2014 12:00:00 AM  65 to 80+  Female  Bachelor's degree or higher
1058  01/01/2014 12:00:00 AM  65 to 80+  Female  Bachelor's degree or higher
1059  01/01/2014 12:00:00 AM  65 to 80+  Female  Bachelor's degree or higher

         Personal Income  Population Count
0              No Income               NaN
1              No Income          650889.0
2       $5,000 to $9,999           30152.0
3     $10,000 to $14,999            7092.0
4     $15,000 to $24,999            3974.0
...                  ...               ...
1055  $15,000 to $24,999           82988.0
1056  $25,000 to $34,999           59607.0
1057  $35,000 to $49,999          113584.0
1058  $50,000 to $74,999           97657.0
1059    $75,000 and over          110009.0

[1060 rows x 6 columns]>